In [1]:
import pandas as pd
import numpy as np

In [2]:
summer = pd.read_csv('../../Data/summer.csv')

In [3]:
summer.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

# sample() method is used to get a random sample of a DataFrame.
## Parameters: n=7 is the number of random samples to get, random_state=123 is the seed for the random number generator, so that the same random sample is obtained every time.

In [4]:
random_sample = summer.sample(n=7, random_state=123).sort_values(by='Year')

In [5]:
random_sample

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
4196,1924,Paris,Aquatics,Water polo,"AUSTIN, Arthur",USA,Men,Water Polo,Bronze
11961,1968,Mexico,Athletics,Athletics,"FOSBURY, Richard Douglas",USA,Men,High Jump,Gold
11742,1968,Mexico,Aquatics,Swimming,"WENDEN, Michael Vincent",AUS,Men,200M Freestyle,Gold
13996,1976,Montreal,Aquatics,Swimming,"MAC DONALD, Gary",CAN,Men,4X100M Medley Relay,Silver
16229,1980,Moscow,Rowing,Rowing,"DMITRIENKO, Grigori",URS,Men,Eight With Coxswain (8+),Bronze
19728,1992,Barcelona,Aquatics,Swimming,"KULIKOV, Vladislav",EUN,Men,4X100M Medley Relay,Silver
25901,2004,Athens,Boxing,Boxing,"YELEUOV, Serik",KAZ,Men,57 - 60KG (Lightweight),Bronze

In [11]:
city_country = {'Paris': 'France', 'Mexico': 'Mexico', 'Montreal': 'Canada', 'Moscow': 'Russia', 'Barcelona': 'Spain', 'Athens': 'Greece'}

# The map() method is used to map values from a Series to another Series. In this case, we are mapping the values of the 'City' column to the values of the 'city_country' dictionary.

In [12]:
random_sample['City'].map(city_country)

4196     France
11961    Mexico
11742    Mexico
13996    Canada
16229    Russia
19728     Spain
25901    Greece
Name: City, dtype: object

# In this case, we are creating a new column 'Host_Country' in the 'random_sample' DataFrame, which contains the values of the 'City' column mapped to the values of the 'city_country' dictionary.

In [13]:
random_sample['Host_Country'] = random_sample['City'].map(city_country)
random_sample.Host_Country

4196     France
11961    Mexico
11742    Mexico
13996    Canada
16229    Russia
19728     Spain
25901    Greece
Name: Host_Country, dtype: object

In [14]:
titanic = pd.read_csv('../titanic.csv')

In [15]:
mapper = {
    1: 'First', 2: 'Second', 3: 'Third'
}

In [16]:
titanic.pclass.map(mapper)

0       Third
1       First
2       Third
3       First
4       Third
        ...
886    Second
887     First
888     Third
889     First
890     Third
Name: pclass, Length: 891, dtype: object

### In this case we overwrite the 'pclass' column with the mapped values. map() method is used to map values from a Series to another Series. In this case, we are mapping the values of the 'pclass' column to the values of the 'mapper' dictionary.

In [17]:
titanic.pclass = titanic.pclass.map(mapper)

In [18]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0   Third    male  22.0      1      0   7.2500        S  NaN
1           1   First  female  38.0      1      0  71.2833        C    C
2           1   Third  female  26.0      0      0   7.9250        S  NaN
3           1   First  female  35.0      1      0  53.1000        S    C
4           0   Third    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0  Second    male  27.0      0      0  13.0000        S  NaN
887         1   First  female  19.0      0      0  30.0000        S    B
888         0   Third  female   NaN      1      2  23.4500        S  NaN
889         1   First    male  26.0      0      0  30.0000        C    C
890         0   Third    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [19]:
gender = {
    'female': 'F',
    'male': 'M'
}

In [21]:
titanic['sex'] = titanic.sex.map(gender)

In [22]:
titanic

     survived  pclass sex   age  sibsp  parch     fare embarked deck
0           0   Third   M  22.0      1      0   7.2500        S  NaN
1           1   First   F  38.0      1      0  71.2833        C    C
2           1   Third   F  26.0      0      0   7.9250        S  NaN
3           1   First   F  35.0      1      0  53.1000        S    C
4           0   Third   M  35.0      0      0   8.0500        S  NaN
..        ...     ...  ..   ...    ...    ...      ...      ...  ...
886         0  Second   M  27.0      0      0  13.0000        S  NaN
887         1   First   F  19.0      0      0  30.0000        S    B
888         0   Third   F   NaN      1      2  23.4500        S  NaN
889         1   First   M  26.0      0      0  30.0000        C    C
890         0   Third   M  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [23]:
deth_dict = {
    0 : 'Dead',
    1 : 'Survivor'
}

In [24]:
titanic['survived'] = titanic.survived.map(deth_dict)

In [25]:
titanic

     survived  pclass sex   age  sibsp  parch     fare embarked deck
0        Dead   Third   M  22.0      1      0   7.2500        S  NaN
1    Survivor   First   F  38.0      1      0  71.2833        C    C
2    Survivor   Third   F  26.0      0      0   7.9250        S  NaN
3    Survivor   First   F  35.0      1      0  53.1000        S    C
4        Dead   Third   M  35.0      0      0   8.0500        S  NaN
..        ...     ...  ..   ...    ...    ...      ...      ...  ...
886      Dead  Second   M  27.0      0      0  13.0000        S  NaN
887  Survivor   First   F  19.0      0      0  30.0000        S    B
888      Dead   Third   F   NaN      1      2  23.4500        S  NaN
889  Survivor   First   M  26.0      0      0  30.0000        C    C
890      Dead   Third   M  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

# Conditional Transformation

## We suppose that a passenger is alone if he/she has no siblings or spouse on board. We can create a new column 'Alone_Passenger' that indicates whether a passenger is alone or not. 0 == means the passenger is alone, 1 == means the passenger is not alone.

In [31]:
titanic.sibsp == 0

0      False
1      False
2       True
3      False
4       True
       ...
886     True
887     True
888    False
889     True
890     True
Name: sibsp, Length: 891, dtype: bool

# The np.where() method is used to return elements chosen from x or y depending on condition. In this case, we are checking if the 'sibsp' column is equal to 0. If it is, we return 'YES', otherwise we return 'NO'.

In [33]:
np.where(titanic.sibsp == 0, 'YES', 'NO')

array(['NO', 'NO', 'YES', 'NO', 'YES', 'YES', 'YES', 'NO', 'YES', 'NO',
       'NO', 'YES', 'YES', 'NO', 'YES', 'YES', 'NO', 'YES', 'NO', 'YES',
       'YES', 'YES', 'YES', 'YES', 'NO', 'NO', 'YES', 'NO', 'YES', 'YES',
       'YES', 'NO', 'YES', 'YES', 'NO', 'NO', 'YES', 'YES', 'NO', 'NO',
       'NO', 'NO', 'YES', 'NO', 'YES', 'YES', 'NO', 'YES', 'NO', 'NO',
       'NO', 'YES', 'NO', 'NO', 'YES', 'YES', 'YES', 'YES', 'NO', 'NO',
       'YES', 'YES', 'NO', 'NO', 'YES', 'NO', 'YES', 'YES', 'NO', 'NO',
       'YES', 'NO', 'YES', 'NO', 'YES', 'YES', 'YES', 'YES', 'YES', 'YES',
       'YES', 'YES', 'YES', 'YES', 'YES', 'NO', 'NO', 'YES', 'NO', 'YES',
       'YES', 'YES', 'NO', 'NO', 'YES', 'YES', 'YES', 'YES', 'YES', 'NO',
       'YES', 'YES', 'YES', 'YES', 'NO', 'YES', 'YES', 'YES', 'YES', 'NO',
       'YES', 'NO', 'YES', 'NO', 'YES', 'YES', 'YES', 'NO', 'YES', 'NO',
       'NO', 'YES', 'NO', 'YES', 'YES', 'NO', 'YES', 'YES', 'NO', 'YES',
       'YES', 'YES', 'NO', 'NO', 'YES', 'YES', 'YES', 'NO', 'YES', 'YES',
       'YES', 'YES', 'NO', 'YES', 'YES', 'NO', 'YES', 'NO', 'YES', 'YES',
       'YES', 'NO', 'YES', 'YES', 'YES', 'YES', 'YES', 'YES', 'YES', 'NO',
       'YES', 'YES', 'YES', 'YES', 'NO', 'YES', 'YES', 'NO', 'YES', 'YES',
       'YES', 'NO', 'NO', 'YES', 'YES', 'NO', 'NO', 'YES', 'YES', 'YES',
       'NO', 'YES', 'NO', 'NO', 'YES', 'YES', 'NO', 'YES', 'NO', 'YES',
       'YES', 'YES', 'NO', 'NO', 'YES', 'YES', 'YES', 'YES', 'YES', 'YES',
       'YES', 'NO', 'YES', 'YES', 'YES', 'YES', 'NO', 'YES', 'YES', 'YES',
       'YES', 'YES', 'YES', 'YES', 'NO', 'NO', 'YES', 'NO', 'YES', 'YES',
       'YES', 'YES', 'YES', 'YES', 'NO', 'YES', 'YES', 'YES', 'YES', 'NO',
       'NO', 'YES', 'YES', 'NO', 'YES', 'YES', 'NO', 'YES', 'YES', 'YES',
       'NO', 'NO', 'YES', 'YES', 'YES', 'NO', 'YES', 'YES', 'NO', 'NO',
       'YES', 'NO', 'YES', 'NO', 'YES', 'YES', 'YES', 'YES', 'YES', 'YES',
       'YES', 'NO', 'NO', 'YES', 'YES', 'YES', 'NO', 'NO', 'YES', 'YES',
       'YES', 'YES', 'YES', 'YES', 'YES', 'NO', 'YES', 'YES', 'NO', 'NO',
       'YES', 'YES', 'YES', 'YES', 'YES', 'YES', 'YES', 'YES', 'YES',
       'YES', 'YES', 'NO', 'YES', 'YES', 'YES', 'YES', 'YES', 'NO', 'YES',
       'YES', 'YES', 'NO', 'YES', 'YES', 'YES', 'NO', 'YES', 'NO', 'NO',
       'YES', 'YES', 'NO', 'NO', 'YES', 'NO', 'YES', 'NO', 'YES', 'YES',
       'NO', 'YES', 'YES', 'YES', 'NO', 'NO', 'YES', 'YES', 'YES', 'NO',
       'YES', 'NO', 'YES', 'YES', 'NO', 'NO', 'YES', 'NO', 'YES', 'YES',
       'YES', 'NO', 'NO', 'YES', 'YES', 'YES', 'YES', 'YES', 'NO', 'NO',
       'YES', 'YES', 'YES', 'NO', 'NO', 'YES', 'YES', 'YES', 'YES', 'YES',
       'YES', 'NO', 'NO', 'YES', 'YES', 'NO', 'YES', 'NO', 'YES', 'YES',
       'YES', 'NO', 'NO', 'YES', 'YES', 'NO', 'NO', 'YES', 'YES', 'YES',
       'YES', 'YES', 'YES', 'YES', 'NO', 'YES', 'YES', 'NO', 'YES', 'YES',
       'YES', 'NO', 'YES', 'NO', 'NO', 'YES', 'YES', 'YES', 'YES', 'YES',
       'YES', 'YES', 'YES', 'NO', 'NO', 'YES', 'NO', 'YES', 'NO', 'YES',
       'NO', 'YES', 'YES', 'NO', 'YES', 'YES', 'YES', 'NO', 'YES', 'YES',
       'YES', 'YES', 'YES', 'YES', 'NO', 'NO', 'YES', 'NO', 'YES', 'YES',
       'YES', 'YES', 'NO', 'NO', 'YES', 'NO', 'NO', 'NO', 'NO', 'NO',
       'YES', 'NO', 'YES', 'NO', 'YES', 'YES', 'YES', 'YES', 'YES', 'NO',
       'YES', 'NO', 'NO', 'YES', 'NO', 'YES', 'YES', 'YES', 'NO', 'YES',
       'YES', 'YES', 'YES', 'YES', 'YES', 'YES', 'YES', 'YES', 'YES',
       'YES', 'NO', 'YES', 'YES', 'NO', 'YES', 'YES', 'YES', 'NO', 'NO',
       'YES', 'YES', 'NO', 'YES', 'YES', 'YES', 'NO', 'NO', 'NO', 'YES',
       'YES', 'NO', 'NO', 'YES', 'YES', 'YES', 'YES', 'YES', 'NO', 'YES',
       'NO', 'YES', 'YES', 'YES', 'YES', 'YES', 'YES', 'NO', 'YES', 'YES',
       'YES', 'YES', 'YES', 'YES', 'YES', 'NO', 'YES', 'YES', 'YES',
       'YES', 'NO', 'YES', 'YES', 'YES', 'YES', 'YES', 'YES', 'YES',
       'YES', 'YES', 'YES', 'NO', 'NO', 'YES', 'NO', 'YES', 'YES', 'YES',
       'YES', 'YES', 'YES', 'YES', 'YES', 'NO', 'NO', 'NO', 'NO', 'YES',
       'NO', 'YES', 'NO', 'NO', 'YES', 'YES', 'YES', 'YES', 'YES', 'YES',
       'NO', 'YES', 'NO', 'NO', 'YES', 'YES', 'YES', 'YES', 'YES', 'NO',
       'YES', 'YES', 'YES', 'YES', 'YES', 'NO', 'YES', 'YES', 'YES',
       'YES', 'YES', 'NO', 'NO', 'YES', 'NO', 'NO', 'YES', 'YES', 'YES',
       'YES', 'YES', 'NO', 'YES', 'YES', 'YES', 'NO', 'YES', 'YES', 'NO',
       'NO', 'YES', 'YES', 'YES', 'NO', 'NO', 'YES', 'YES', 'YES', 'YES',
       'NO', 'YES', 'YES', 'NO', 'YES', 'NO', 'YES', 'NO', 'YES', 'YES',
       'NO', 'NO', 'NO', 'NO', 'YES', 'NO', 'NO', 'NO', 'YES', 'YES',
       'YES', 'YES', 'YES', 'YES', 'YES', 'YES', 'YES', 'YES', 'YES',
       'NO', 'YES', 'YES', 'NO', 'YES', 'NO', 'YES', 'YES', 'NO', 'YES',
       'NO', 'NO', 'YES', 'YES', 'YES', 'YES', 'YES', 'YES', 'YES', 'YES',
       'YES', 'NO', 'YES', 'NO', 'YES', 'YES', 'NO', 'YES', 'YES', 'YES',
       'NO', 'NO', 'YES', 'YES', 'YES', 'NO', 'NO', 'NO', 'YES', 'YES',
       'YES', 'YES', 'YES', 'YES', 'NO', 'YES', 'YES', 'YES', 'YES', 'NO',
       'NO', 'NO', 'NO', 'YES', 'YES', 'YES', 'NO', 'YES', 'YES', 'YES',
       'YES', 'YES', 'YES', 'YES', 'NO', 'YES', 'NO', 'YES', 'YES', 'YES',
       'NO', 'YES', 'YES', 'YES', 'YES', 'NO', 'YES', 'YES', 'NO', 'YES',
       'YES', 'YES', 'YES', 'YES', 'YES', 'YES', 'YES', 'NO', 'YES',
       'YES', 'NO', 'YES', 'NO', 'YES', 'NO', 'NO', 'YES', 'YES', 'YES',
       'YES', 'YES', 'YES', 'NO', 'YES', 'YES', 'YES', 'YES', 'NO', 'NO',
       'NO', 'YES', 'NO', 'NO', 'YES', 'NO', 'YES', 'NO', 'YES', 'YES',
       'YES', 'NO', 'NO', 'YES', 'YES', 'YES', 'YES', 'YES', 'YES', 'YES',
       'NO', 'YES', 'NO', 'YES', 'YES', 'NO', 'YES', 'YES', 'YES', 'YES',
       'YES', 'NO', 'YES', 'YES', 'YES', 'YES', 'YES', 'YES', 'NO', 'YES',
       'NO', 'YES', 'YES', 'YES', 'NO', 'NO', 'YES', 'YES', 'YES', 'NO',
       'YES', 'YES', 'YES', 'YES', 'YES', 'YES', 'NO', 'YES', 'NO', 'NO',
       'YES', 'YES', 'YES', 'YES', 'YES', 'YES', 'NO', 'YES', 'YES',
       'YES', 'NO', 'YES', 'YES', 'YES', 'NO', 'YES', 'NO', 'NO', 'YES',
       'YES', 'YES', 'NO', 'YES', 'YES', 'YES', 'YES', 'YES', 'NO', 'NO',
       'YES', 'YES', 'YES', 'NO', 'YES', 'YES', 'YES', 'YES', 'YES',
       'YES', 'YES', 'YES', 'YES', 'YES', 'NO', 'YES', 'YES', 'NO', 'NO',
       'YES', 'NO', 'YES', 'NO', 'YES', 'NO', 'YES', 'YES', 'YES', 'NO',
       'NO', 'YES', 'NO', 'YES', 'YES', 'NO', 'YES', 'YES', 'NO', 'YES',
       'NO', 'YES', 'YES', 'NO', 'YES', 'YES', 'YES', 'YES', 'YES', 'YES',
       'YES', 'YES', 'YES', 'YES', 'YES', 'YES', 'YES', 'NO', 'YES',
       'YES'], dtype='<U3')

# The pd.Series() method is used to create a new Series. In this case, we are creating a new Series 'Alone_Passenger' that contains the values returned by the np.where() method.

In [46]:
titanic['Alone_Passenger'] = pd.Series(np.where(titanic.sibsp == 0, 'Yes', 'No'))

In [47]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,deck,Alone,Alone_Passenger
0,Dead,Third,M,22.0,1,0,7.2500,S,NaN,No,No
1,Survivor,First,F,38.0,1,0,71.2833,C,C,No,No
2,Survivor,Third,F,26.0,0,0,7.9250,S,NaN,Yes,Yes
3,Survivor,First,F,35.0,1,0,53.1000,S,C,No,No
4,Dead,Third,M,35.0,0,0,8.0500,S,NaN,Yes,Yes
...,...,...,...,...,...,...,...,...,...,...,...
886,Dead,Second,M,27.0,0,0,13.0000,S,NaN,Yes,Yes
887,Survivor,First,F,19.0,0,0,30.0000,S,B,Yes,Yes
888,Dead,Third,F,NaN,1,2,23.4500,S,NaN,No,No
889,Survivor,First,M,26.0,0,0,30.0000,C,C,Yes,Yes
890,Dead,Third,M,32.0,0,0,7.7500,Q,NaN,Yes,Yes

In [48]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   survived         891 non-null    object
 1   pclass           891 non-null    object
 2   sex              891 non-null    object
 3   age              714 non-null    float64
 4   sibsp            891 non-null    int64
 5   parch            891 non-null    int64
 6   fare             891 non-null    float64
 7   embarked         889 non-null    object
 8   deck             203 non-null    object
 9   Alone            891 non-null    object
 10  Alone_Passenger  891 non-null    object
dtypes: float64(2), int64(2), object(7)
memory usage: 76.7+ KB

# The np.where() method is used to return elements chosen from x or y depending on condition. In this case, we are checking if the 'age' column is less than 18. If it is, we return 'YES', otherwise we return 'NO'.

In [49]:
titanic['Child'] = np.where(titanic.age < 18, 'Yes', 'No')

In [50]:
titanic.Child

0      No
1      No
2      No
3      No
4      No
       ..
886    No
887    No
888    No
889    No
890    No
Name: Child, Length: 891, dtype: object